Revit 2027 API
BuiltInFailures.RevisionFailures Class
 Failures about Revision Settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.RevisionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RevisionFailures
Public NotInheritable Class RevisionFailures
public ref class RevisionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevisionFailures = class end
The BuiltInFailures.RevisionFailures type exposes the following members.
Properties
Name | Description
RevisionSettingsDuplicateName |  More than one Revisons have the same name %1!s!.
Top
See Also
Reference
Autodesk.Revit.DB Namespace